head()
tail()
iloc()
loc()
describe()
unique()
info()
len()
Categorical()

In [3]:
import pandas as pd
df=pd.read_csv('titanic.csv')
print(df.head())
print(df.tail())
print(df.iloc[:3])
print(df.iloc[:3])
print(df.describe())
print(df['Sex'].unique())
print(df.info())
print(len(df))
print(pd.Categorical(df['Sex']))

   Unnamed: 0  PassengerId  Survived  Pclass  \
0           0            1         0       3
1           1            2         1       1
2           2            3         1       3
3           3            4         1       1
4           4            5         0       3

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                           Allen, Mr. William Henry    male  35.0      0

   Parch            Ticket     Fare Cabin Embarked
0      0         A/5 21171   7.2500   NaN        S
1      0          PC 17599  71.2833   C85        C
2      0  STON/O2. 3101282   7.9250   NaN        S
3      0            113803  53.1000  C123        S
4      0            373450   8.0500   NaN        S
     Unnamed: 0  PassengerId  Survived  Pclass  \
886         886          887         0       2
887         887          888         1       1
888         888          889         0       3
889         889          890         1       1
890         890          891         0       3

                                         Name     Sex   Age  SibSp  Parch  \
886                     Montvila, Rev. Juozas    male  27.0      0      0
887              Graham, Miss. Margaret Edith  female  19.0      0      0
888  Johnston, Miss. Catherine Helen "Carrie"  female   NaN      1      2
889                     Behr, Mr. Karl Howell    male  26.0      0      0
890                       Dooley, Mr. Patrick    male  32.0      0      0

         Ticket   Fare Cabin Embarked
886      211536  13.00   NaN        S
887      112053  30.00   B42        S
888  W./C. 6607  23.45   NaN        S
889      111369  30.00  C148        C
890      370376   7.75   NaN        Q
   Unnamed: 0  PassengerId  Survived  Pclass  \
0           0            1         0       3
1           1            2         1       1
2           2            3         1       3

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0

   Parch            Ticket     Fare Cabin Embarked
0      0         A/5 21171   7.2500   NaN        S
1      0          PC 17599  71.2833   C85        C
2      0  STON/O2. 3101282   7.9250   NaN        S
   Unnamed: 0  PassengerId  Survived  Pclass  \
0           0            1         0       3
1           1            2         1       1
2           2            3         1       3

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0

   Parch            Ticket     Fare Cabin Embarked
0      0         A/5 21171   7.2500   NaN        S
1      0          PC 17599  71.2833   C85        C
2      0  STON/O2. 3101282   7.9250   NaN        S
       Unnamed: 0  PassengerId    Survived      Pclass         Age  \
count  891.000000   891.000000  891.000000  891.000000  714.000000
mean   445.000000   446.000000    0.383838    2.308642   29.699118
std    257.353842   257.353842    0.486592    0.836071   14.526497
min      0.000000     1.000000    0.000000    1.000000    0.420000
25%    222.500000   223.500000    0.000000    2.000000   20.125000
50%    445.000000   446.000000    0.000000    3.000000   28.000000
75%    667.500000   668.500000    1.000000    3.000000   38.000000
max    890.000000   891.000000    1.000000    3.000000   80.000000

            SibSp       Parch        Fare
count  891.000000  891.000000  891.000000
mean     0.523008    0.381594   32.204208
std      1.102743    0.806057   49.693429
min      0.000000    0.000000    0.000000
25%      0.000000    0.000000    7.910400
50%      0.000000    0.000000   14.454200
75%      1.000000    0.000000   31.000000
max      8.000000    6.000000  512.329200
['male' 'female']
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 13 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Unnamed: 0   891 non-null    int64
 1   PassengerId  891 non-null    int64
 2   Survived     891 non-null    int64
 3   Pclass       891 non-null    int64
 4   Name         891 non-null    object
 5   Sex          891 non-null    object
 6   Age          714 non-null    float64
 7   SibSp        891 non-null    int64
 8   Parch        891 non-null    int64
 9   Ticket       891 non-null    object
 10  Fare         891 non-null    float64
 11  Cabin        204 non-null    object
 12  Embarked     889 non-null    object
dtypes: float64(2), int64(6), object(5)
memory usage: 90.6+ KB
None
891
['male', 'female', 'female', 'female', 'male', ..., 'male', 'female', 'female', 'male', 'male']
Length: 891
Categories (2, object): ['female', 'male']

In [4]:
df1 = pd.DataFrame({
    'A': [10, 20, 30],
    'B': [40, 50, 60],
    'C': [70, 80, 90]
})
df1.index=range(1,2*len(df1)+1,2)
print(df1)

    A   B   C
1  10  40  70
3  20  50  80
5  30  60  90

In [20]:
import pandas as pd

data = {
    'Values': [20, 30, 70, 80, 90, 100],   # âœ… list
    'Name': ['ara', 'oro', 'ariya', 'lpo', 'klo', 'hjo']
}

df2 = pd.DataFrame(data)

df2.loc[0:i, ['Values']].sum()

Values    120
dtype: int64

In [25]:
import pandas as pd

df = pd.DataFrame({
    'Text': [
        'I love data science',
        'Pandas is very powerful',
        'Word count column'
    ]
})

df['Word_Count']=df['Text'].str.split().str.len()
df

                      Text  Word_Count
0      I love data science           4
1  Pandas is very powerful           4
2        Word count column           3

DataFrame.size
Returns the total number of elements in the DataFrame =(number_of_rows*number_of_columns)

DtaFrame.shape
(number_of_rows, number_of_columns)

read_excel("name of file)

In [28]:
df=pd.DataFrame({'Email':['shambhavi@gmail.com','somya@gmail.com','sonu@gmail.com','ghou@gmail.com']})
df['Name']=df['Email'].str.split('@').str[0]
df

                 Email       Name
0  shambhavi@gmail.com  shambhavi
1      somya@gmail.com      somya
2       sonu@gmail.com       sonu
3       ghou@gmail.com       ghou

In [37]:
import pandas as pd

df = pd.DataFrame({
    'A': [3, 8, 6, 2, 9],
    'B': [5, 2, 9, 3, 1],
    'C': [1, 7, 4, 5, 2]
})

sf = df[(df['A'] > 5) | (df['B'] > 10)]
sf

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

In [38]:
import pandas as pd

df = pd.DataFrame({
    'Values': [10, 20, 30, 40, 50]
})
s=df['Values'].mean()
d=df['Values'].median()
e=df['Values'].std()
print(s,d,e)

30.0 30.0 15.811388300841896

In [40]:
import pandas as pd

df = pd.DataFrame({
    'Date': pd.date_range('2024-01-01', periods=10),
    'Sales': [10, 12, 11, 13, 15, 14, 16, 18, 17, 19]
})
df['Date'] = pd.to_datetime(df['Date'])
df = df.sort_values('Date')
df['MovingAverage'] = df['Sales'].rolling(window=7, min_periods=1).mean()
df

        Date  Sales  MovingAverage
0 2024-01-01     10      10.000000
1 2024-01-02     12      11.000000
2 2024-01-03     11      11.000000
3 2024-01-04     13      11.500000
4 2024-01-05     15      12.200000
5 2024-01-06     14      12.500000
6 2024-01-07     16      13.000000
7 2024-01-08     18      14.142857
8 2024-01-09     17      14.857143
9 2024-01-10     19      16.000000

In [41]:
import pandas as pd
df = pd.DataFrame({
    'Date': pd.date_range('2024-01-01', periods=10),
    'Sales': [10, 12, 11, 13, 15, 14, 16, 18, 17, 19]
})
df['Date']=pd.to_datetime(df['Date'])
df['WEEKday']=df['Date'].dt.day_name()
df

        Date  Sales    WEEKday
0 2024-01-01     10     Monday
1 2024-01-02     12    Tuesday
2 2024-01-03     11  Wednesday
3 2024-01-04     13   Thursday
4 2024-01-05     15     Friday
5 2024-01-06     14   Saturday
6 2024-01-07     16     Sunday
7 2024-01-08     18     Monday
8 2024-01-09     17    Tuesday
9 2024-01-10     19  Wednesday

In [42]:
import pandas as pd

# Sample DataFrame with timestamps
df = pd.DataFrame({
    'Date': [
        '2023-01-01 10:15:00',
        '2023-01-05 14:30:00',
        '2023-01-20 09:00:00',
        '2023-02-01 12:00:00',
        '2022-12-31 23:59:59'
    ],
    'Sales': [100, 200, 150, 300, 50]
})
df['Date'] = pd.to_datetime(df['Date'])

# Step 2: Define start and end of January 2023
start_date = '2023-01-01'
end_date = '2023-02-01'  # exclusive end to include all Jan dates

# Step 3: Filter rows between start_date and end_date
df_january = df[(df['Date'] >= start_date) & (df['Date'] < end_date)]

# Step 4: Display result
print(df_january)

                 Date  Sales
0 2023-01-01 10:15:00    100
1 2023-01-05 14:30:00    200
2 2023-01-20 09:00:00    150

pandas